<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadDisplayName</key>
    <string>iOS終極打卡解決方案 (無限制版)</string>
    <key>PayloadDescription</key>
    <string>突破iOS背景限制的終極打卡解決方案，無輸入限制</string>
    <key>PayloadIdentifier</key>
    <string>com.mphasis.ios.ultimate.unmanaged.checkin.v1</string>
    <key>PayloadOrganization</key>
    <string>Mphasis Limited</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>U1V1W1X1-Y1Z1-9876-5432-098765432109</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadScope</key>
    <string>User</string>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>PayloadType</key>
            <string>com.apple.webClip</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>PayloadIdentifier</key>
            <string>com.mphasis.ios.ultimate.unmanaged.webclip.v1</string>
            <key>PayloadUUID</key>
            <string>V2W2X2Y2-Z2A2-1234-5678-987654321098</string>
            <key>PayloadDisplayName</key>
            <string>終極打卡方案 (無限制)</string>
            <key>PayloadDescription</key>
            <string>無輸入限制的終極解決方案</string>
            <key>Label</key>
            <string>🏆終極打卡</string>
            <key>URL</key>
            <string>https://raw.githubusercontent.com/YOUR_USERNAME/YOUR_REPO/main/ios_ultimate_checkin.html</string>
            <key>IsRemovable</key>
            <true/>
            <key>FullScreen</key>
            <false/>
            <key>Precomposed</key>
            <false/>
        </dict>
    </array>
</dict>
</plist>
