<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadDisplayName</key>
    <string>iOS簡易打卡系統</string>
    <key>PayloadDescription</key>
    <string>修復按鈕問題的 iOS 簡易打卡系統</string>
    <key>PayloadIdentifier</key>
    <string>com.mphasis.ios.simple.checkin.v1</string>
    <key>PayloadOrganization</key>
    <string>Mphasis Limited</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>A1B1C1D1-E1F1-4444-8888-123456789ABC</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadScope</key>
    <string>User</string>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>PayloadType</key>
            <string>com.apple.webClip.managed</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>PayloadIdentifier</key>
            <string>com.mphasis.ios.simple.webclip.v1</string>
            <key>PayloadUUID</key>
            <string>B2C2D2E2-F2G2-5555-9999-987654321DEF</string>
            <key>PayloadDisplayName</key>
            <string>iOS簡易打卡</string>
            <key>PayloadDescription</key>
            <string>修復按鈕問題的簡易打卡系統</string>
            <key>Label</key>
            <string>📱簡易打卡</string>
            <key>URL</key>
            <string>https://jomywu0203.github.io/mphasis-checkin/ios_simple_checkin.html</string>
            <key>IsRemovable</key>
            <true/>
            <key>FullScreen</key>
            <true/>
            <key>Precomposed</key>
            <false/>
        </dict>
    </array>
</dict>
</plist>
