<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadDisplayName</key>
    <string>iOS智慧引導打卡</string>
    <key>PayloadDescription</key>
    <string>提供分步驟視覺引導的 iOS 打卡系統</string>
    <key>PayloadIdentifier</key>
    <string>com.mphasis.ios.guided.checkin.v1</string>
    <key>PayloadOrganization</key>
    <string>Mphasis Limited</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>C1D1E1F1-G1H1-4567-8901-234567890123</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadScope</key>
    <string>User</string>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>PayloadType</key>
            <string>com.apple.webClip.managed</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>PayloadIdentifier</key>
            <string>com.mphasis.ios.guided.webclip.v1</string>
            <key>PayloadUUID</key>
            <string>D2E2F2G2-H2I2-5678-9012-345678901234</string>
            <key>PayloadDisplayName</key>
            <string>智慧引導打卡</string>
            <key>PayloadDescription</key>
            <string>分步驟視覺引導的打卡系統</string>
            <key>Label</key>
            <string>🎯智慧引導</string>
            <key>URL</key>
            <string>https://jomywu0203.github.io/mphasis-checkin/ios_guided_checkin.html</string>
            <key>IsRemovable</key>
            <true/>
            <key>FullScreen</key>
            <true/>
            <key>Precomposed</key>
            <false/>
        </dict>
    </array>
</dict>
</plist>
